Failed to change length of fixed part.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FixedFabricationPartNotChangeLength { get; }
  Visual Basic
Public Shared ReadOnly Property FixedFabricationPartNotChangeLength As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FixedFabricationPartNotChangeLength {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace